cf_billing/DataProcessors/бестМассовоеИзменениеПараметровМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестМассовоеИзменениеПараметровМКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовВидУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовПоставщикУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекВидУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекПоставщикУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МКД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекВидБлагоустройства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекВидУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекПоставщикУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргФормыУправленияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФормыУправленияМКД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормаУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргФормыУправленияМКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетОбъемовВыполняетУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВидБлагоустройствМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВидБлагоустройствМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУслугиТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчетаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчетаМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоставщикиУслугМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоставщикиУслугМКД</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/DataProcessors/бестМассовоеИзменениеПараметровМКД/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекВидОперации	= "ВидБлагоустройства";
	ВидимостьРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ВидимостьРеквизитов();
КонецПроцедуры

&НаСервере
Процедура УКПриИзмененииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура УКПриИзменении(Элемент)
	УКПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьИзменение(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьНаСервере()
	Если ТекВидОперации = "ВидБлагоустройства" Тогда
		СменаВидаБлагоустройства();
	ИначеЕсли ТекВидОперации = "ВидУслуги" Тогда
		СменаВидаУслуг();		
	ИначеЕсли ТекВидОперации = "ПоставщикУслуг" Тогда
		СменаПоставщикаУслуг();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьРеквизитов()
	Если ТекВидОперации 		= "ВидБлагоустройства" Тогда
		Элементы.НовВидБлагоустройства.Видимость 	= Истина;
		Элементы.ТекВидБлагоустройства.Видимость 	= Истина;
		Элементы.МКДТекВидБлагоустройства.Видимость	= Истина;
		Элементы.НовВидУслуги.Видимость 			= Истина;
		Элементы.ТекВидУслуги.Видимость 			= Истина;
		Элементы.МКДТекТочкаУчета.Видимость 		= Ложь;
		Элементы.МКДТекВидУслуги.Видимость 			= Истина;
		Элементы.ТекПоставщикУслуги.Видимость 		= Ложь;
		Элементы.НовПоставщикУслуги.Видимость 		= Ложь;
		Элементы.МКДТекПоставщикУслуги.Видимость 	= Ложь;
	ИначеЕсли ТекВидОперации 	= "ВидУслуги" Тогда
		Элементы.НовВидБлагоустройства.Видимость 	= Ложь;
		Элементы.ТекВидБлагоустройства.Видимость 	= Ложь;
		Элементы.МКДТекВидБлагоустройства.Видимость	= Ложь;
		Элементы.НовВидУслуги.Видимость 			= Истина;
		Элементы.ТекВидУслуги.Видимость 			= Истина;
		Элементы.МКДТекТочкаУчета.Видимость 		= Истина;
		Элементы.МКДТекВидУслуги.Видимость 			= Истина; 
		Элементы.ТекПоставщикУслуги.Видимость 		= Истина;		         
		Элементы.НовПоставщикУслуги.Видимость 		= Истина;
		Элементы.МКДТекПоставщикУслуги.Видимость 	= Истина;
	ИначеЕсли ТекВидОперации 	= "ПоставщикУслуг" Тогда	
		Элементы.НовВидБлагоустройства.Видимость 	= Ложь;
		Элементы.ТекВидБлагоустройства.Видимость 	= Ложь;
		Элементы.МКДТекВидБлагоустройства.Видимость	= Ложь;
		Элементы.НовВидУслуги.Видимость 			= Истина;
		Элементы.ТекВидУслуги.Видимость 			= Истина;
		Элементы.МКДТекТочкаУчета.Видимость 		= Истина;
		Элементы.МКДТекВидУслуги.Видимость 			= Истина;		         
		Элементы.НовПоставщикУслуги.Видимость 		= Истина;
		Элементы.ТекПоставщикУслуги.Видимость 		= Истина;
		Элементы.МКДТекПоставщикУслуги.Видимость 	= Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 			Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Район", 			Объект.Район);
	МВТ				= Новый МенеджерВременныхТаблиц;	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Текст = "ВЫБРАТЬ
	|	энргСостояниеМКДСрезПоследних.Организация КАК Организация,
	|	энргСостояниеМКДСрезПоследних.Район КАК Район,
	|	энргСостояниеМКДСрезПоследних.МКД КАК МКД
	|ПОМЕСТИТЬ ВрТ_МКД
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргМногоквартирныеДома.Ссылка КАК МКД,
	|		энргМногоквартирныеДома.Организация КАК Организация,
	|		энргМногоквартирныеДома.Район КАК Район
	|	ИЗ
	|		Справочник.энргСтроения КАК энргМногоквартирныеДома
	|	ГДЕ
	|		НЕ энргМногоквартирныеДома.ЭтоГруппа
	|		И энргМногоквартирныеДома.Район = &Район
	|		И энргМногоквартирныеДома.Организация = &Организация
	|		И НЕ энргМногоквартирныеДома.ПометкаУдаления
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргМногоквартирныеДома.Ссылка,
	|		энргМногоквартирныеДома.Организация,
	|		энргМногоквартирныеДома.Район) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеМКД.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И Район = &Район) КАК энргСостояниеМКДСрезПоследних
	|		ПО ВложенныйЗапрос.МКД = энргСостояниеМКДСрезПоследних.МКД
	|			И ВложенныйЗапрос.Организация = энргСостояниеМКДСрезПоследних.Организация
	|			И ВложенныйЗапрос.Район = энргСостояниеМКДСрезПоследних.Район
	|			И (энргСостояниеМКДСрезПоследних.Состояние)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргСостояниеМКДСрезПоследних.Район,
	|	энргСостояниеМКДСрезПоследних.МКД,
	|	энргСостояниеМКДСрезПоследних.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ_МКД.Организация КАК Организация,
	|	ВрТ_МКД.Район КАК Район,
	|	ВрТ_МКД.МКД КАК МКД,
	|	ЕСТЬNULL(энргФормыУправленияМКДСрезПоследних.УК, """") КАК УК
	|ПОМЕСТИТЬ ВрТ_УК
	|ИЗ
	|	ВрТ_МКД КАК ВрТ_МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргФормыУправленияМКД.СрезПоследних(
	|				&Дата,
	|				Район = &Район
	|					И Организация = &Организация) КАК энргФормыУправленияМКДСрезПоследних
	|		ПО ВрТ_МКД.Организация = энргФормыУправленияМКДСрезПоследних.Организация
	|			И ВрТ_МКД.Район = энргФормыУправленияМКДСрезПоследних.Район
	|			И ВрТ_МКД.МКД = энргФормыУправленияМКДСрезПоследних.МКД
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ_МКД.МКД,
	|	ВрТ_МКД.Организация,
	|	ВрТ_МКД.Район,
	|	ЕСТЬNULL(энргФормыУправленияМКДСрезПоследних.УК, """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ_УК.Организация КАК Организация,
	|	ВрТ_УК.Район КАК Район,
	|	ВрТ_УК.МКД КАК МКД
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	ВрТ_УК КАК ВрТ_УК
	|ГДЕ
	|	ВрТ_УК.УК = &УК
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ_УК.Организация,
	|	ВрТ_УК.Район,
	|	ВрТ_УК.МКД";
	
	Текст = СтрЗаменить(Текст, "	ВрТ_УК.УК = &УК", "Истина");
	Запрос.Текст = Текст;
	Запрос.Выполнить();	
	
	
	Если ТекВидОперации 		= "ВидБлагоустройства" Тогда
		//Запрос	= Новый запрос;
		Запрос.МенеджерВременныхТаблиц	= МВТ;
		Запрос.УстановитьПараметр("Дата", 				Объект.Дата);
		Запрос.УстановитьПараметр("ВидУслуги", 			Объект.ТекВидУслуги);
		Запрос.УстановитьПараметр("ВидБлагоустройства", Объект.ТекВидБлагоустройства);
		Текст = "ВЫБРАТЬ
		|	ВрТ0.Организация КАК Организация,
		|	ВрТ0.Район КАК Район,
		|	ВрТ0.МКД КАК МКД,
		|	энргВидБлагоустройствМКДСрезПоследних.ВидБлагоустройства КАК ТекВидБлагоустройства,
		|	энргВидБлагоустройствМКДСрезПоследних.Услуга КАК Услуга
		|ИЗ
		|	ВрТ0 КАК ВрТ0
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргВидБлагоустройствМКД.СрезПоследних(
		|				&Дата,
		|				Услуга = &ВидУслуги
		|					И ВидБлагоустройства = &ВидБлагоустройства) КАК энргВидБлагоустройствМКДСрезПоследних
		|		ПО ВрТ0.Организация = энргВидБлагоустройствМКДСрезПоследних.Организация
		|			И ВрТ0.Район = энргВидБлагоустройствМКДСрезПоследних.Район
		|			И ВрТ0.МКД = энргВидБлагоустройствМКДСрезПоследних.МКД
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТ0.Организация,
		|	ВрТ0.Район,
		|	ВрТ0.МКД,
		|	энргВидБлагоустройствМКДСрезПоследних.Услуга,
		|	энргВидБлагоустройствМКДСрезПоследних.ВидБлагоустройства";
		Если Не ЗначениеЗаполнено(Объект.ТекВидУслуги) Тогда
			Текст = СтрЗаменить(Текст, "Услуга = &ВидУслуги", "Истина");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ТекВидБлагоустройства) Тогда
			Текст = СтрЗаменить(Текст, "И ВидБлагоустройства = &ВидБлагоустройства", "И Истина");
		КонецЕсли;
		
		Запрос.Текст = Текст;
		Результат = Запрос.Выполнить();
		Выгрузка = Результат.Выгрузить();
		
		Объект.МКД.Загрузить(Выгрузка);
	ИначеЕсли ТекВидОперации 	= "ВидУслуги" Тогда
		//Запрос	= Новый запрос;
		Запрос.МенеджерВременныхТаблиц	= МВТ;
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Услуга", Объект.ТекВидУслуги);
		Текст = "ВЫБРАТЬ
		|	ВрТ0.Организация КАК Организация,
		|	ВрТ0.Район КАК Район,
		|	ВрТ0.МКД КАК МКД,
		|	ЕСТЬNULL(энргУслугиТочекУчетаМКДСрезПоследних.ТочкаУчета, """") КАК ТекТочкаУчета,
		|	ЕСТЬNULL(энргУслугиТочекУчетаМКДСрезПоследних.Услуга, """") КАК ТекВидУслуги
		|ИЗ
		|	ВрТ0 КАК ВрТ0
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(&Дата, Услуга = &Услуга) КАК энргУслугиТочекУчетаМКДСрезПоследних
		|		ПО ВрТ0.Организация = энргУслугиТочекУчетаМКДСрезПоследних.Организация
		|			И ВрТ0.Район = энргУслугиТочекУчетаМКДСрезПоследних.Район
		|			И ВрТ0.МКД = энргУслугиТочекУчетаМКДСрезПоследних.МКД
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТ0.Организация,
		|	ВрТ0.Район,
		|	ВрТ0.МКД,
		|	ЕСТЬNULL(энргУслугиТочекУчетаМКДСрезПоследних.Услуга, """"),
		|	ЕСТЬNULL(энргУслугиТочекУчетаМКДСрезПоследних.ТочкаУчета, """")";
		
		Запрос.Текст = Текст;
		Результат = Запрос.Выполнить();
		Выгрузка = Результат.Выгрузить();
		
		Объект.МКД.Загрузить(Выгрузка);
	ИначеЕсли ТекВидОперации 	= "ПоставщикУслуг" Тогда
		//Запрос	= Новый запрос;
		Запрос.МенеджерВременныхТаблиц	= МВТ;
		Запрос.УстановитьПараметр("Дата", 		Объект.Дата);
		Запрос.УстановитьПараметр("Поставщик", 	Объект.ТекПоставщикУслуги);
		Текст = "ВЫБРАТЬ
		|	ВрТ0.Организация КАК Организация,
		|	ВрТ0.Район КАК Район,
		|	ВрТ0.МКД КАК МКД,
		|	ЕСТЬNULL(энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета, """") КАК ТекТочкаУчета
		|ПОМЕСТИТЬ ВрТ1
		|ИЗ
		|	ВрТ0 КАК ВрТ0
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргАктивностьТочекУчетаМКД.СрезПоследних(&Дата, ) КАК энргАктивностьТочекУчетаМКДСрезПоследних
		|		ПО ВрТ0.Организация = энргАктивностьТочекУчетаМКДСрезПоследних.Организация
		|			И ВрТ0.Район = энргАктивностьТочекУчетаМКДСрезПоследних.Район
		|			И ВрТ0.МКД = энргАктивностьТочекУчетаМКДСрезПоследних.МКД
		|			И (энргАктивностьТочекУчетаМКДСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТ0.Организация,
		|	ВрТ0.Район,
		|	ВрТ0.МКД,
		|	ЕСТЬNULL(энргАктивностьТочекУчетаМКДСрезПоследних.ТочкаУчета, """")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТ1.Организация КАК Организация,
		|	ВрТ1.Район КАК Район,
		|	ВрТ1.МКД КАК МКД,
		|	ВрТ1.ТекТочкаУчета КАК ТекТочкаУчета,
		|	энргУслугиТочекУчетаМКДСрезПоследних.Услуга КАК Услуга
		|ПОМЕСТИТЬ ВрТ2
		|ИЗ
		|	ВрТ1 КАК ВрТ1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчетаМКД.СрезПоследних(&Дата, ) КАК энргУслугиТочекУчетаМКДСрезПоследних
		|		ПО ВрТ1.Организация = энргУслугиТочекУчетаМКДСрезПоследних.Организация
		|			И ВрТ1.Район = энргУслугиТочекУчетаМКДСрезПоследних.Район
		|			И ВрТ1.МКД = энргУслугиТочекУчетаМКДСрезПоследних.МКД
		|			И ВрТ1.ТекТочкаУчета = энргУслугиТочекУчетаМКДСрезПоследних.ТочкаУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТ1.МКД,
		|	энргУслугиТочекУчетаМКДСрезПоследних.Услуга,
		|	ВрТ1.Район,
		|	ВрТ1.Организация,
		|	ВрТ1.ТекТочкаУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВрТ2.Организация КАК Организация,
		|	ВрТ2.Район КАК Район,
		|	ВрТ2.МКД КАК МКД,
		|	ВрТ2.ТекТочкаУчета КАК ТекТочкаУчета,
		|	ВрТ2.Услуга КАК ТекВидУслуги,
		|	ЕСТЬNULL(энргПоставщикиУслугМКДСрезПоследних.Поставщик, """") КАК ТекПоставщикУслуги
		|ИЗ
		|	ВрТ2 КАК ВрТ2
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПоставщикиУслугМКД.СрезПоследних(&Дата, ) КАК энргПоставщикиУслугМКДСрезПоследних
		|		ПО ВрТ2.Организация = энргПоставщикиУслугМКДСрезПоследних.Организация
		|			И ВрТ2.Район = энргПоставщикиУслугМКДСрезПоследних.Район
		|			И ВрТ2.МКД = энргПоставщикиУслугМКДСрезПоследних.МКД
		|			И ВрТ2.ТекТочкаУчета = энргПоставщикиУслугМКДСрезПоследних.ТочкаУчета
		|			И ВрТ2.Услуга = энргПоставщикиУслугМКДСрезПоследних.Услуга
		|			И (энргПоставщикиУслугМКДСрезПоследних.Поставщик = &Поставщик)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВрТ2.ТекТочкаУчета,
		|	ВрТ2.Район,
		|	ВрТ2.Организация,
		|	ВрТ2.Услуга,
		|	ЕСТЬNULL(энргПоставщикиУслугМКДСрезПоследних.Поставщик, """"),
		|	ВрТ2.МКД";
		
		Если Не ЗначениеЗаполнено(объект.ТекПоставщикУслуги) Тогда
			Текст	= СтрЗаменить(Текст, "			И (энргПоставщикиУслугМКДСрезПоследних.Поставщик = &Поставщик)", "			И Истина");	
		КонецЕсли;
		
		Запрос.Текст = Текст;	
		Результат = Запрос.Выполнить();
		Выгрузка = Результат.Выгрузить();
		
		Объект.МКД.Загрузить(Выгрузка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СменаПоставщикаУслуг()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", Объект.МКД.Выгрузить());
	Запрос.УстановитьПараметр("Поставщик", Объект.НовПоставщикУслуги);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗ.МКД КАК МКД,
	|	ТЗ.ТекТочкаУчета КАК ТочкаУчета,
	|	ТЗ.ТекВидУслуги КАК Услуга,
	|	&Поставщик КАК ПоставщикПосле,
	|	ТЗ.ТекПоставщикУслуги КАК Поставщик
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.МКД КАК МКД,
	|	ВрТ0.ТочкаУчета КАК ТочкаУчета,
	|	ВрТ0.Услуга КАК Услуга,
	|	ВрТ0.ПоставщикПосле КАК ПоставщикПосле,
	|	ВрТ0.Поставщик КАК Поставщик
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|ИТОГИ ПО
	|	МКД";
	Результат 	= Запрос.Выполнить();
	Выборка 	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТекДата		= ТекущаяДата();
	
	Пока Выборка.Следующий() Цикл
		ТекМКД					= Выборка.МКД;
		НовДок					= Документы.энргСменаПоставщикаМКД.СоздатьДокумент();
		НовДок.Дата				= Объект.Дата;
		НовДок.ПериодНачисления	= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		НовДок.Организация		= Объект.Организация;
		НовДок.Район			= Объект.Район;
		НовДок.МКД				= ТекМКД;
		НовДок.Ответственный	= Пользователи.ТекущийПользователь();
		НовДок.Примечание		= "Создан обработкой";
			
		ВыборкаДетали			= Выборка.Выбрать();
		ТЧ						= НовДок.ТочкиУчета;
		Пока ВыборкаДетали.Следующий() Цикл
			НовСтрока			= ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетали);
		КонецЦикла;	
		Попытка
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(НовДок.Ссылка) + " проведен");
		Исключение
			НовДок.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(НовДок.Ссылка) + " записан. Необходимо проверить документ и провести");
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура СменаВидаУслуг()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", Объект.МКД.Выгрузить());
	Запрос.УстановитьПараметр("Поставщик", Объект.НовПоставщикУслуги);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗ.МКД КАК МКД,
	|	ТЗ.ТекТочкаУчета КАК ТочкаУчета,
	|	ТЗ.ТекВидУслуги КАК Услуга,
	|	&Поставщик КАК ПоставщикПосле,
	|	ТЗ.ТекПоставщикУслуги КАК Поставщик
	|ИЗ
	|	&ТЗ КАК ТЗ
	|ИТОГИ ПО
	|	МКД";
	Результат 	= Запрос.Выполнить();
	Выборка 	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТекДата		= ТекущаяДата();
	
	Пока Выборка.Следующий() Цикл
		ТекМКД					= Выборка.МКД;
		НовДок					= Документы.энргСменаПоставщикаМКД.СоздатьДокумент();
		НовДок.Дата				= Объект.Дата;
		НовДок.Организация		= Объект.Организация;
		НовДок.Район			= Объект.Район;
		НовДок.МКД				= ТекМКД;
		НовДок.Ответственный	= Пользователи.ТекущийПользователь();
		НовДок.Примечание		= "Создан обработкой";
		НовДок.энргДатаСозданияДокумента = ТекДата;
		НовДок.энргДатаПоследнегоИзменения = ТекДата;
		
		ВыборкаДетали			= Выборка.Выбрать();
		ТЧ						= НовДок.ТочкиУчета;
		Пока ВыборкаДетали.Следующий() Цикл
			НовСтрока			= ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетали);
		КонецЦикла;	
		Попытка
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(НовДок.Ссылка) + " проведен");
		Исключение
			НовДок.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(НовДок.Ссылка) + " записан. Необходимо проверить документ и провести");
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СменаВидаБлагоустройства()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", Объект.МКД.Выгрузить());
	Запрос.УстановитьПараметр("ВидБлагоустройства", Объект.НовВидБлагоустройства);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗ.МКД КАК МКД,
	|	ТЗ.ТекВидУслуги КАК Услуга,
	|	&ВидБлагоустройства КАК ВидБлагоустройстваОбщедомовой
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.МКД КАК МКД,
	|	ВрТ0.Услуга КАК Услуга,
	|	ВрТ0.ВидБлагоустройстваОбщедомовой КАК ВидБлагоустройстваОбщедомовой
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ0.Услуга,
	|	ВрТ0.ВидБлагоустройстваОбщедомовой,
	|	ВрТ0.МКД
	|ИТОГИ ПО
	|	МКД";
	Результат 	= Запрос.Выполнить();
	Выборка 	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТекДата		= ТекущаяДата();
	
	Пока Выборка.Следующий() Цикл
		ТекМКД					= Выборка.МКД;
		НовДок					= Документы.энргУстановитьВидБлагоустройстваМКД.СоздатьДокумент();
		НовДок.Дата				= Объект.Дата;
		НовДок.ПериодНачисления	= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		НовДок.Организация		= Объект.Организация;
		НовДок.Район			= Объект.Район;
		НовДок.МКД				= ТекМКД;
		НовДок.Ответственный	= Пользователи.ТекущийПользователь();
		НовДок.Примечание		= "Создан обработкой";
		НовДок.энргДатаСозданияДокумента = ТекДата;
		НовДок.энргДатаПоследнегоИзменения = ТекДата;
		
		ВыборкаДетали			= Выборка.Выбрать();
		ТЧ						= НовДок.ВидыБлагоустройстваТарифныеКатегории;
		Пока ВыборкаДетали.Следующий() Цикл
			НовСтрока			= ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетали);
		КонецЦикла;	
		Попытка
			НовДок.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(НовДок.Ссылка) + " проведен");
		Исключение
			НовДок.Записать(РежимЗаписиДокумента.Запись);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(НовДок.Ссылка) + " записан. Необходимо проверить документ и провести");
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
